# 1)შექმენით სია შემდგარი 10 ელემენტისგან, და გამოიტანეთ მხოლოდ კენტ ინდექსზე მდგომი ელემენტი

Elements=["porshe", "Giorgi" , "Nika" , "Pc", "luka", "saba", "vano" ,"ilia", "zirakashvili" , "Demetre"]

for i in range(10):
    if i % 2 == 0 :
        print(Elements[i])

# 2)შექმენით სია რომელიც შედგება 5 რიცხვისგან, გადაუარეთ ამ სიას for ციკლით და შეაჯამეთ თითოეული რიცხვი, 
# ბოლოს გამოიტანეთ ამ რიცხვების ჯამი (დაგჭირდებათ ერთი დამატებითი დამთვლელი ცვლადი (ჯამის ცვლადი, რომელსაც თითოეული რიცხვი დაემატება ყოველ იტერაციაზე))

nums = [5 , 10 , 20, 15 , 13]
sum = 0 
for i in nums:
    sum += 1 
print(sum)


    

# 3)შექმენით სია შემდგარი 10 რიცხვისგან, გადაურეთ for ციკლით, შეამოწმეთ კენტია თუ ლუწი, თუ ლუწია დაბეჭდეთ i, "luwia", თუ კენტია i, "kentia"

numbers=[2,5,7,9,3,1,10,40,20,23]
for i in numbers:
    if i % 2 == 0 :
        print(i,"luwia")
    elif i % 2 == 1:
        print(i,"kentia")





    