"""ცვლადების გამოყენებით დაბეჭდეთ თქვენი სახელი და გვარი, შემდეგ დაბეჭდეთ 3 მათემატიკური ოპერაციის (+,-,*) შედეგი და თქვენი ჰობი, ყველაფერი ახსენით კომენტარებით ქართულად და ცვლადებს სახელები დაარქვით snake_case-ის სტილში (გამოიყენეთ სტანდარტები და საუკეთესო პრაქტიკები)"""

#ვბეჭდავთ ჩვენს სახელსა და გვარს
first_name= "Giorgi"
last_name= "Zirakashvili"
print(first_name  + " " +  last_name)

#ვბეჭდავთ 3 მათემატიკურ ოპერაციის შედეგებს

#მიმატება
plus_1= 5 + 10
print(plus_1)

plus_2 = 10 + 50
print(plus_2)

plus_3 = 90 +100
print(plus_3)

#გამოკლება

minus_1 = 50 -10
print(minus_1)


#გამრავლება

time_1= 5 * 5
print(time_1)


#ვბეჭდავთ ჩვენს ჰობს

my_hobby = "writing_codes"
print(my_hobby)

