"""1)შექმენით 8 ცვლადი სადაც შეინახავთ ყველა შესაძლო ლოგიკური ოპერატორის მაგალითს (4 ცალი or / 4 ცალი and)"""

#4 ცალი ლოგიკური ოპერაციების მაგალითი (OR)

print(2 > 3 or 5 > 1) #true
print(2 == 2 or 1 <= 2) #true
print(30 < 10 or 20 > 100)#false
print("Phone" == "Phone " or "Device" == "PC")#false

#4 ცალი ლოგიკური ოპერაციების მაგალითი (AND)

print(50 + 50 > 30 - 10 and 1 < 0)#false
print(890 > 1000 and 1000 == 1000)#false
print(500 >10 and 500 == 500) #true
print("Giorgi" == "Giorgi" and 100 > 50) #true


"""2)მომხმარებელს შემოატანინეთ მისი სახელი, შემოატანინეთ მისი ასაკი, ასევე სიმაღლე და შეამოწმეთ თუ მომხმარებლის ასაკი მეტია 18 და მისი სახელი უდრის თქვენს სახელს და ასევე მისი სიმაღლე მეტია 1.80-ზე"""

name = input("Enter your name: ")

my_name = "Giorgi"

height = int(input("enter yur height: "))

age = int(input("Enter your age: "))

print(name == my_name)
print(age > 18)
print(height > 1.80)

"""3)ახსენით თითოეული ალგორითმის გამოსახვის გზა (flowchart / pseudocode / natural language)"""

#flowchart არის გზა ალგორითმის გამოსახვის რომელიც აიხსნება სხვადასვხვა დიაგრამების დამხარებით 
#pseudocode არის ერთერთი გზა ალგორითმის გამოსახვის რომელიც აიხსნება კოდით თუ როგორ იწერება ის 
#natural language  არის კიდევ ერთი გზა ალგორითმის გამოსახვის , ჩვენ ჩენს მიერ დაწერილს კოდს ვხსნით ჩვეულებრივი ენით .



