# 1) შექმენით სია რიცხვებით და დაწერე კოდი, რომელიც გამოითვლის სიის ყველა ელემენტის ნამრავლს და დაბეჭდავს შედეგს.
nums=[10,20,5,2,15]
print(nums[0]*nums[1]*nums[2]*nums[3]*nums[4])
    

# 2)შექმენით სია სადაც იქნება 10 ელემენტი გამოიტანეთ,მე0 ინდექსიდან მე_8 ინდექსის ჩათვლით ყველა ელემენტი.

elements=["gio","nika","vano","nargiza","jemala","dima","viola","aleksandre","anastasia","liza"]
print(elements[0:9])

# 3)შექმენით სია სადაც იქნება ხუთი რიცხვი, გადაუარეთ ამ სიას for ციკლის საშუალებით და შეამოწმეთ თუ სიიდან რომელიმე რიცხვი ნაკლებია 5ზე დავბეჭდოთ ის რიცხვი.
numbers=[10,3,2,4,15]
for i in nums:
    if i < 5:
        print(i)

# 4)შექმენით სია სადაც იქნება 10 რიცხვი და შექმენით sum ცვლადი რომლის საშუალებითაც გამოითვლით ამ ყველა რიცხვის ჯამს.
nums1=[10,20,30,15,5,2,7,40,55,14]
sum= 0
for i in nums1:
    sum += 1
    print(sum)


# 5)კომენტარებით ახსენით რისი გაკეთება შეგვიძლია slicing ით.
# slicing ით ჩვენ შეგვიძლია ამოვჭრათ სხვადასხვა ელემენტები სიიდან
# ასევე შევადგინოთ სიტყვა ელემენტების ამოჭრის დახმარებით
#ახალი ცვლადის შედგენა და სხვა...