# 1)შექმენით სია რომელშიც იქნება 5 სახელი შემდეგ, ამოიღეთ სიიდან პირველი და ბოლო ელემენტი


names = ["gio", "nika" , "Zauri" , "vano" , "ilia"]

names.pop(0)
names.pop(-1)

print(names)

# 2)კომეტარებით ახსენით რას აკეთებს თითოეული ფუნქცია:

# .insert() - ამატებს ახალ ელემენტს მოცემულ ინდექსზე
# .append() - ამატებს ახალ ელემენტს სიის ბოლოში
# .pop() - სიიდან ამოშლის მოცემულ ინდექსზე მყოფ ელემენტს
# .len() - სიას რამდენი ელემენტიც აქ იმდენს ითვლის ხოლო სტრინგს რამდენი ასოც

# 3) შექმენით სია რომელიც შედგება 5 სახელისგან შემდეგ insert მეთოდით დაამატეთ ახალი სახელი სიის მეორე ინდექსზე

names1= ["nika","Vano","Giorgi","Ilia","dato"]
names1.insert(2,"Beqa")
print(names1)