"""1)გამოიტანეთ რიცხვები 0-დან 10-ის ჩათვლით"""

for i in range(11):
    print(i)


"""2)გამოიტანეთ რიცხვები 50-დან 150-მდე"""

for i in range(50,150):
    print(i)
 
"""3)გამოიტანეთ მხოლოდ ლუწი რიცხვები 200-დან 500-მდე"""

for i in range(200,500,2):
    print(i)



"""4)გამოიტანეთ კენტი რიცხვები 0-დან 50-მდე"""

for i in range(1,50,2):
    print(i)

"""5)მომხმარებელს შემოატანინეთ მისი გვარი და გამოიტანეთ ამ გვარის თითოეული ასო ცალცალკე"""

surname = input("Enter your surname: ")

for i in range(surname):
    print(i)


#for loops ვიყენებთ როდესაც რაიმე კოდის გამეორება გვესაჭიროება მაგალითად კვდრატის დასახაზად from turtle import ში რადგან ჩვენ დავუშვებთ ნაკლებ შეცდომას და დროშიც შევიზღუდებით
