# 1)შექმენით ფუნქცია რომელსაც გადაეცემა ორი რიცხვი შემდეგ დააბრუნეთ მათი ნამრავლი return ის გამოყენებით 
def multiply(num1,num2):
    return num1 * num2

print(multiply(5,2))
# --------------------------------------------------------------------------------------------
# 2)ახსენით რაც დღეს გავიარეთ (isalnum,isdigit,islower,isnumeric,isupper,count) მეთოდები თითოეული რას აკეთებს.

# isalnum აბრუნებს true მხოლოდ იმ შემთხვევში თუ კოდი შეიცავს ასოებს და რიცხვებს დანარჩენ შემთხვევაში false.

# isdigit აბრუნებს true მხოლოდ იმ ჩემთხვევაში თუ  კოდი მთლიანად არის ციფრები სხვა შემთხვევაში false.

# islower აბრუნებს true მხოლოდ იმ შემთხვევაში თუ კოდი შედგება მხოლოდ პატარა ასოებით სხვა შემთხვევაში false.

# isupper აბრუნებს true მხოლოდ იმ შემთხვევაში თუ კოდი შედგება მხოლოდ დიდი ასოებიტთ სხვა შემთხვევაში false.

# count ითვლის კონკრეტულ ელემენტს რამდენია კოდში.



# --------------------------------------------------------------------------------------------
# 3)ასევე ახსენით რას აკეთებს min და max ჩაშენებული ფუნქციები

# min გამოაქვს მინიმალური მნიშვნელობა
# max გამოაქვს მაქსიმალური მნიშვნელობა
# .